[
    {
        "title": "The Swiss Army YouTube Searcher",
        "link": "http://youtube-searcher-8972.herokuapp.com/",
        "ghlink": "//github.com/gfed53/youtube-searcher-firebase",
        "image": "./images-min/says.png",
        "blurb": "A YouTube-based app powered by Angular 1.x and the YouTube Data, Google Maps, and Yandex Translator APIs. It allows the user to make fine-grain, robust video and channel searches, as well as create an account where they can save videos and specific “searches” to a Google Firebase database."
    },
    {
        "title": "Rich Text Post Feed",
        "link": "http://gregs-cms-123.herokuapp.com/home",
        "ghlink": "https://github.com/gfed53/meteor-react-cms",
        "image": "./images-min/post-feed.png",
        "blurb": "A post feed and rich text-based content management system built with ReactJS, Draft.js, and Meteor. This app implements an accounts system and allows you to create posts using rich-text, such as bold, italics, underline as well as headers, lists, etc."
    },
    {
        "title": "SpotiCycle",
        "link": "http://as-cycle-123.herokuapp.com/",
        "ghlink": "//github.com/gfed53/ang2-spotify",
        "image": "./images-min/spoticycle-1.png",
        "blurb": "A self-motivated project using Angular 2+ and the Spotify API, allowing the user to search for artists and then cycle through related artists of infinite degrees of separation."
    },
    {
        "title": "GameHunter",
        "ghlink": "https://github.com/gfed53/ang-mongo-igdb",
        "image": "./images-min/game-hunter.png",
        "blurb": "A video game-themed MEAN stack app powered by the IGDB API. This app allows the user to search for a particular game of interest, then grab similar games based on user-specified criteria (restricting game platform, time period, etc.) as well as an internal algorithm I've created.",
        "blurb_important": "Note: This project is currently being reworked due to a new version of IGDB's API (3.0), decommissioning the old version this project previously interfaced with. Even though the app may not currently be functional, feel free to check out the codebase."
    }
]
